ЕСКД/src/Catalogs/mega_ЕдиницыИзмерения/mega_ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_ЕдиницыИзмерения</name>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.mega_КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЦелаяНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЦелаяНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_ЕдиницыИзмерения/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.ЕдиницаПоКлассификатору);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиЭлементовФормы()
	
	Элементы.Вес.Заголовок = СтрШаблон("Вес, %1", Строка(ЕдиницаИзмеренияВеса));
	Элементы.Объем.Заголовок = СтрШаблон("Объем, %1", Строка(ЕдиницаИзмеренияОбъема));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕдиницаИзмеренияВеса = Константы.mega_ОсновнаяЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияОбъема = Константы.mega_ОсновнаяЕдиницаИзмеренияОбъема.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовкиЭлементовФормы();
КонецПроцедуры
